matthewdeanmartin/nanacoin/nanacoin_rs/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# Request bodies are capped at api::BODY_LIMIT (1 KiB), so a 16 KiB TLS
# input record buffer was ~16x oversized. Four concurrent sessions at 16 KiB
# could not be allocated inside CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL and
# tripped the startup task watchdog; 4 KiB makes four sessions fit.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_HTTPD_MAX_REQ_HDR_LEN=768
CONFIG_HTTPD_MAX_URI_LEN=96
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
